w200024212/pebbleos/src/fw/vendor/nrf5-sdk-uarte-backport/haly/nrfy_uarte.h
/** @refhal{nrf_uarte_shorts_set} */
NRFY_STATIC_INLINE void nrfy_uarte_shorts_set(NRF_UARTE_Type * p_reg, uint32_t mask)
{
    nrf_uarte_shorts_set(p_reg, mask);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_shorts_get} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_shorts_get(NRF_UARTE_Type * p_reg, uint32_t mask)
{
    nrf_barrier_rw();
    uint32_t ret = nrf_uarte_shorts_get(p_reg, mask);
    nrf_barrier_r();

    return ret;
}

/** @refhal{nrf_uarte_shorts_enable} */
NRFY_STATIC_INLINE void nrfy_uarte_shorts_enable(NRF_UARTE_Type * p_reg, uint32_t mask)
{
    nrf_uarte_shorts_enable(p_reg, mask);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_shorts_disable} */
NRFY_STATIC_INLINE void nrfy_uarte_shorts_disable(NRF_UARTE_Type * p_reg, uint32_t mask)
{
    nrf_uarte_shorts_disable(p_reg, mask);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_int_enable} */
NRFY_STATIC_INLINE void nrfy_uarte_int_enable(NRF_UARTE_Type * p_reg, uint32_t mask)
{
    nrf_uarte_int_enable(p_reg, mask);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_int_enable_check} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_int_enable_check(NRF_UARTE_Type const * p_reg,
                                                        uint32_t               mask)
{
    nrf_barrier_rw();
    uint32_t check = nrf_uarte_int_enable_check(p_reg, mask);
    nrf_barrier_r();
    return check;
}

/** @refhal{nrf_uarte_int_disable} */
NRFY_STATIC_INLINE void nrfy_uarte_int_disable(NRF_UARTE_Type * p_reg, uint32_t mask)
{
    nrf_uarte_int_disable(p_reg, mask);
    nrf_barrier_w();
}

#if defined(DPPI_PRESENT) || defined(__NRFX_DOXYGEN__)
/** @refhal{nrf_uarte_subscribe_set} */
NRFY_STATIC_INLINE void nrfy_uarte_subscribe_set(NRF_UARTE_Type * p_reg,
                                                 nrf_uarte_task_t task,
                                                 uint8_t          channel)
{
    nrf_uarte_subscribe_set(p_reg, task, channel);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_subscribe_clear} */
NRFY_STATIC_INLINE void nrfy_uarte_subscribe_clear(NRF_UARTE_Type * p_reg, nrf_uarte_task_t task)
{
    nrf_uarte_subscribe_clear(p_reg, task);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_publish_set} */
NRFY_STATIC_INLINE void nrfy_uarte_publish_set(NRF_UARTE_Type *  p_reg,
                                               nrf_uarte_event_t event,
                                               uint8_t           channel)
{
    nrf_uarte_publish_set(p_reg, event, channel);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_publish_clear} */
NRFY_STATIC_INLINE void nrfy_uarte_publish_clear(NRF_UARTE_Type *  p_reg, nrf_uarte_event_t event)
{
    nrf_uarte_publish_clear(p_reg, event);
    nrf_barrier_w();
}
#endif // defined(DPPI_PRESENT) || defined(__NRFX_DOXYGEN__)

/** @refhal{nrf_uarte_errorsrc_get_and_clear} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_errorsrc_get_and_clear(NRF_UARTE_Type * p_reg)
{
    nrf_barrier_rw();
    uint32_t errorsrc = nrf_uarte_errorsrc_get(p_reg);
    nrf_barrier_rw();
    nrf_uarte_errorsrc_clear(p_reg, errorsrc);
    nrf_barrier_rw();
    return errorsrc;
}

/** @refhal{nrf_uarte_enable} */
NRFY_STATIC_INLINE void nrfy_uarte_enable(NRF_UARTE_Type * p_reg)
{
    nrf_uarte_enable(p_reg);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_disable} */
NRFY_STATIC_INLINE void nrfy_uarte_disable(NRF_UARTE_Type * p_reg)
{
    nrf_uarte_disable(p_reg);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_enable_check} */
NRFY_STATIC_INLINE bool nrfy_uarte_enable_check(NRF_UARTE_Type * p_reg)
{
    nrf_barrier_rw();
    bool ret = nrf_uarte_enable_check(p_reg);
    nrf_barrier_r();
    return ret;
}

/** @refhal{nrf_uarte_txrx_pins_set} */
NRFY_STATIC_INLINE void nrfy_uarte_txrx_pins_set(NRF_UARTE_Type * p_reg,
                                                 uint32_t         pseltxd,
                                                 uint32_t         pselrxd)
{
    nrf_uarte_txrx_pins_set(p_reg, pseltxd, pselrxd);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_txrx_pins_disconnect} */
NRFY_STATIC_INLINE void nrfy_uarte_txrx_pins_disconnect(NRF_UARTE_Type * p_reg)
{
    nrf_uarte_txrx_pins_disconnect(p_reg);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_tx_pin_get} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_tx_pin_get(NRF_UARTE_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t pin = nrf_uarte_tx_pin_get(p_reg);
    nrf_barrier_r();
    return pin;
}

/** @refhal{nrf_uarte_rx_pin_get} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_rx_pin_get(NRF_UARTE_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t pin = nrf_uarte_rx_pin_get(p_reg);
    nrf_barrier_r();
    return pin;
}

/** @refhal{nrf_uarte_rts_pin_get} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_rts_pin_get(NRF_UARTE_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t pin = nrf_uarte_rts_pin_get(p_reg);
    nrf_barrier_r();
    return pin;
}

/** @refhal{nrf_uarte_cts_pin_get} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_cts_pin_get(NRF_UARTE_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t pin = nrf_uarte_cts_pin_get(p_reg);
    nrf_barrier_r();
    return pin;
}

/** @refhal{nrf_uarte_hwfc_pins_set} */
NRFY_STATIC_INLINE void nrfy_uarte_hwfc_pins_set(NRF_UARTE_Type * p_reg,
                                                 uint32_t         pselrts,
                                                 uint32_t         pselcts)
{
    nrf_uarte_hwfc_pins_set(p_reg, pselrts, pselcts);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_hwfc_pins_disconnect} */
NRFY_STATIC_INLINE void nrfy_uarte_hwfc_pins_disconnect(NRF_UARTE_Type * p_reg)
{
    nrf_uarte_hwfc_pins_disconnect(p_reg);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_task_trigger} */
NRFY_STATIC_INLINE void nrfy_uarte_task_trigger(NRF_UARTE_Type * p_reg, nrf_uarte_task_t task)
{
    nrf_uarte_task_trigger(p_reg, task);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_task_address_get} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_task_address_get(NRF_UARTE_Type const * p_reg,
                                                        nrf_uarte_task_t       task)
{
    return nrf_uarte_task_address_get(p_reg, task);
}

/** @refhal{nrf_uarte_configure} */
NRFY_STATIC_INLINE void nrfy_uarte_configure(NRF_UARTE_Type           * p_reg,
                                             nrf_uarte_config_t const * p_cfg)
{
    nrf_uarte_configure(p_reg, p_cfg);
    nrf_barrier_w();
}

