w200024212/pebbleos/src/fw/vendor/nrf5-sdk-uarte-backport/haly/nrfy_uarte.h
/** @refhal{nrf_uarte_baudrate_set} */
NRFY_STATIC_INLINE void nrfy_uarte_baudrate_set(NRF_UARTE_Type *     p_reg,
                                                nrf_uarte_baudrate_t baudrate)
{
    nrf_uarte_baudrate_set(p_reg, baudrate);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_tx_buffer_set} */
NRFY_STATIC_INLINE void nrfy_uarte_tx_buffer_set(NRF_UARTE_Type * p_reg,
                                                 uint8_t  const * p_buffer,
                                                 size_t           length)
{
    if (p_buffer)
    {
        NRFY_CACHE_WB(p_buffer, length);
        nrf_uarte_tx_buffer_set(p_reg, p_buffer, length);
        nrf_barrier_w();
    }
}

/** @refhal{nrf_uarte_tx_buffer_get} */
NRFY_STATIC_INLINE uint8_t const * nrfy_uarte_tx_buffer_get(NRF_UARTE_Type * p_reg)
{
    nrf_barrier_r();
    uint8_t const * ptr = nrf_uarte_tx_buffer_get(p_reg);
    nrf_barrier_r();
    return ptr;
}

/** @refhal{nrf_uarte_tx_amount_get} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_tx_amount_get(NRF_UARTE_Type const * p_reg)
{
    nrf_barrier_r();
    uint32_t amount = nrf_uarte_tx_amount_get(p_reg);
    nrf_barrier_r();
    return amount;
}

/** @refhal{nrf_uarte_rx_buffer_set} */
NRFY_STATIC_INLINE void nrfy_uarte_rx_buffer_set(NRF_UARTE_Type * p_reg,
                                                 uint8_t *        p_buffer,
                                                 size_t           length)
{
    nrf_uarte_rx_buffer_set(p_reg, p_buffer, length);
    nrf_barrier_w();
}

/** @refhal{nrf_uarte_rx_amount_get} */
NRFY_STATIC_INLINE uint32_t nrfy_uarte_rx_amount_get(NRF_UARTE_Type const * p_reg)
{
    nrf_barrier_r();
    uint32_t amount = nrf_uarte_rx_amount_get(p_reg);
    nrf_barrier_r();
    return amount;
}

#if NRFX_CHECK(NRFY_UARTE_HAS_FRAME_TIMEOUT)
/** @refhal{nrf_uarte_frame_timeout_set} */
NRFY_STATIC_INLINE void nrfy_uarte_frame_timeout_set(NRF_UARTE_Type * p_reg,
                                                     uint32_t         timeout)
{
    nrf_barrier_r();
    nrf_uarte_frame_timeout_set(p_reg, timeout);
    nrf_barrier_r();
}
#endif
/** @} */

NRFY_STATIC_INLINE void __nrfy_internal_uarte_event_enabled_clear(NRF_UARTE_Type *  p_reg,
                                                                  uint32_t          mask,
                                                                  nrf_uarte_event_t event)
{
    if (mask & NRFY_EVENT_TO_INT_BITMASK(event))
    {
        nrf_uarte_event_clear(p_reg, event);
    }
}

NRFY_STATIC_INLINE bool __nrfy_internal_uarte_event_handle(NRF_UARTE_Type *  p_reg,
                                                           uint32_t          mask,
                                                           nrf_uarte_event_t event,
                                                           uint32_t  *       p_evt_mask)
{
    if ((mask & NRFY_EVENT_TO_INT_BITMASK(event)) && nrf_uarte_event_check(p_reg, event))
    {
        nrf_uarte_event_clear(p_reg, event);
        if (p_evt_mask)
        {
            *p_evt_mask |= NRFY_EVENT_TO_INT_BITMASK(event);
        }
        return true;
    }
    return false;
}

NRFY_STATIC_INLINE
uint32_t __nrfy_internal_uarte_events_process(NRF_UARTE_Type *            p_reg,
                                              uint32_t                    mask,
                                              nrfy_uarte_buffer_t const * p_xfer)
{
    uint32_t evt_mask = 0;

    nrf_barrier_r();
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_CTS,       &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_NCTS,      &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_RXDRDY,    &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_ENDRX,     &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_TXDRDY,    &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_ENDTX,     &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_ERROR,     &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_RXTO,      &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_RXSTARTED, &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_TXSTARTED, &evt_mask);
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_TXSTOPPED, &evt_mask);
#if NRFY_UARTE_HAS_FRAME_TIMEOUT
    (void)__nrfy_internal_uarte_event_handle(p_reg, mask, NRF_UARTE_EVENT_FRAME_TIMEOUT, &evt_mask);
#endif

    if (mask & NRFY_EVENT_TO_INT_BITMASK(NRF_UARTE_EVENT_ENDRX))
    {
        NRFY_CACHE_INV(p_xfer->p_buffer, p_xfer->length);
    }
    else if (mask & NRFY_EVENT_TO_INT_BITMASK(NRF_UARTE_EVENT_RXTO))
    {
        size_t size = nrf_uarte_rx_amount_get(p_reg);
        nrf_barrier_rw();
        NRFY_CACHE_INV(p_xfer->p_buffer, size);
    }

    nrf_barrier_w();
    return evt_mask;
}

#ifdef __cplusplus
}
#endif

#endif // NRFY_UARTE_H__
